cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P4011.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>REF_A</name>
        <version>356.0</version>
        <description>REF_A</description>
        <baseAddress>0x40003000</baseAddress>
        <addressBlock>
            <offset>0x0</offset>
            <size>0xC</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                  <name>REFCTL0</name>
                  <displayName>CTL0</displayName>
                  <description>REF Control Register 0</description>
                  <addressOffset>0x0</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>REFON</name>
                        <description>Reference enable</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>REFON_0</name>
                                <description>Disables reference if no other reference requests are pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>REFON_1</name>
                                <description>Enables reference in static mode</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>REFOUT</name>
                        <description>Reference output buffer</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>REFOUT_0</name>
                                <description>Reference output not available externally</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>REFOUT_1</name>
                                <description>Reference output available externally. If ADC14REFBURST = 0, output is available continuously. If ADC14REFBURST = 1, output is available only during an ADC14 conversion.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>REFTCOFF</name>
                        <description>Temperature sensor disabled</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>REFTCOFF_0</name>
                                <description>Temperature sensor enabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>REFTCOFF_1</name>
                                <description>Temperature sensor disabled to save power</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>REFVSEL</name>
                        <description>Reference voltage level select</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>REFVSEL_0</name>
                                <description>1.2 V available when reference requested or REFON = 1</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>REFVSEL_1</name>
                                <description>1.45 V available when reference requested or REFON = 1</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>REFVSEL_3</name>
                                <description>2.5 V available when reference requested or REFON = 1</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>REFGENOT</name>
                        <description>Reference generator one-time trigger</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>REFGENOT_0</name>
                                <description>No trigger</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>REFGENOT_1</name>
                                <description>Generation of the reference voltage is started by writing 1 or by a hardware trigger</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>REFBGOT</name>
                        <description>Bandgap and bandgap buffer one-time trigger</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>REFBGOT_0</name>
                                <description>No trigger</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>REFBGOT_1</name>
                                <description>Generation of the bandgap voltage is started by writing 1 or by a hardware trigger</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>REFGENACT</name>
                        <description>Reference generator active</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>REFGENACT_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>REFGENACT_0</name>
                                <description>Reference generator not active</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>REFGENACT_1</name>
                                <description>Reference generator active</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>REFBGACT</name>
                        <description>Reference bandgap active</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>REFBGACT_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>REFBGACT_0</name>
                                <description>Reference bandgap buffer not active</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>REFBGACT_1</name>
                                <description>Reference bandgap buffer active</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>REFGENBUSY</name>
                        <description>Reference generator busy</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>REFGENBUSY_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>REFGENBUSY_0</name>
                                <description>Reference generator not busy</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>REFGENBUSY_1</name>
                                <description>Reference generator busy</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BGMODE</name>
                        <description>Bandgap mode</description>
                        <bitOffset>0xB</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>BGMODE_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>BGMODE_0</name>
                                <description>Static mode</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BGMODE_1</name>
                                <description>Sampled mode</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>REFGENRDY</name>
                        <description>Variable reference voltage ready status</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>REFGENRDY_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>REFGENRDY_0</name>
                                <description>Reference voltage output is not ready to be used</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>REFGENRDY_1</name>
                                <description>Reference voltage output is ready to be used</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>REFBGRDY</name>
                        <description>Buffered bandgap voltage ready status</description>
                        <bitOffset>0xD</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>REFBGRDY_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>REFBGRDY_0</name>
                                <description>Buffered bandgap voltage is not ready to be used</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>REFBGRDY_1</name>
                                <description>Buffered bandgap voltage is ready to be used</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
