cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P4011.svd
            <register>
                  <name>CExCTL1</name>
                  <displayName>CTL1</displayName>
                  <description>Comparator Control Register 1</description>
                  <addressOffset>0x2</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>CEOUT</name>
                        <description>Comparator output value</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CEOUTPOL</name>
                        <description>Comparator output polarity</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CEOUTPOL_0</name>
                                <description>Noninverted</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEOUTPOL_1</name>
                                <description>Inverted</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CEF</name>
                        <description>Comparator output filter</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CEF_0</name>
                                <description>Comparator output is not filtered</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEF_1</name>
                                <description>Comparator output is filtered</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CEIES</name>
                        <description>Interrupt edge select for CEIIFG and CEIFG</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CEIES_0</name>
                                <description>Rising edge for CEIFG, falling edge for CEIIFG</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEIES_1</name>
                                <description>Falling edge for CEIFG, rising edge for CEIIFG</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CESHORT</name>
                        <description>Input short</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CESHORT_0</name>
                                <description>Inputs not shorted</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CESHORT_1</name>
                                <description>Inputs shorted</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CEEX</name>
                        <description>Exchange</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CEFDLY</name>
                        <description>Filter delay</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CEFDLY_0</name>
                                <description>Typical filter delay of TBD (450) ns</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEFDLY_1</name>
                                <description>Typical filter delay of TBD (900) ns</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEFDLY_2</name>
                                <description>Typical filter delay of TBD (1800) ns</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEFDLY_3</name>
                                <description>Typical filter delay of TBD (3600) ns</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CEPWRMD</name>
                        <description>Power Mode</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CEPWRMD_0</name>
                                <description>High-speed mode</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEPWRMD_1</name>
                                <description>Normal mode</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEPWRMD_2</name>
                                <description>Ultra-low power mode</description>
                                <value>2</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CEON</name>
                        <description>Comparator On</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CEON_0</name>
                                <description>Off</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEON_1</name>
                                <description>On</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CEMRVL</name>
                        <description>This bit is valid of CEMRVS is set to 1</description>
                        <bitOffset>0xB</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CEMRVL_0</name>
                                <description>VREF0 is selected if CERS = 00, 01, or 10</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEMRVL_1</name>
                                <description>VREF1 is selected if CERS = 00, 01, or 10</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CEMRVS</name>
                        <description>This bit defines if the comparator output selects between VREF0 or VREF1 if CERS = 00, 01, or 10.</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CEMRVS_0</name>
                                <description>Comparator output state selects between VREF0 or VREF1</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEMRVS_1</name>
                                <description>CEMRVL selects between VREF0 or VREF1</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>CExCTL2</name>
                  <displayName>CTL2</displayName>
                  <description>Comparator Control Register 2</description>
                  <addressOffset>0x4</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>CEREF0</name>
                        <description>Reference resistor tap 0</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x5</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CERSEL</name>
                        <description>Reference select</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CERSEL_0</name>
                                <description>When CEEX = 0, VREF is applied to the V+ terminal; When CEEX = 1, VREF is applied to the V- terminal</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CERSEL_1</name>
                                <description>When CEEX = 0, VREF is applied to the V- terminal; When CEEX = 1, VREF is applied to the V+ terminal</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CERS</name>
                        <description>Reference source</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CERS_0</name>
                                <description>No current is drawn by the reference circuitry</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CERS_1</name>
                                <description>VCC applied to the resistor ladder</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CERS_2</name>
                                <description>Shared reference voltage applied to the resistor ladder</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CERS_3</name>
                                <description>Shared reference voltage supplied to V(CREF). Resistor ladder is off</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CEREF1</name>
                        <description>Reference resistor tap 1</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x5</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CEREFL</name>
                        <description>Reference voltage level</description>
                        <bitOffset>0xD</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CEREFL_0</name>
                                <description>Reference amplifier is disabled. No reference voltage is requested</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREFL_1</name>
                                <description>1.2 V is selected as shared reference voltage input</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREFL_2</name>
                                <description>2.0 V is selected as shared reference voltage input</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREFL_3</name>
                                <description>2.5 V is selected as shared reference voltage input</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CEREFACC</name>
                        <description>Reference accuracy</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CEREFACC_0</name>
                                <description>Static mode</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEREFACC_1</name>
                                <description>Clocked (low power, low accuracy) mode</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
