cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P4011.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>DIO</name>
        <version>356.0</version>
        <description>DIO</description>
        <baseAddress>0x40004C00</baseAddress>
        <interrupt>
            <name>PORT1_IRQ</name>
            <description>Port1 Interrupt</description>
            <value>35</value>
        </interrupt>
        <interrupt>
            <name>PORT2_IRQ</name>
            <description>Port2 Interrupt</description>
            <value>36</value>
        </interrupt>
        <interrupt>
            <name>PORT3_IRQ</name>
            <description>Port3 Interrupt</description>
            <value>37</value>
        </interrupt>
        <interrupt>
            <name>PORT4_IRQ</name>
            <description>Port4 Interrupt</description>
            <value>38</value>
        </interrupt>
        <interrupt>
            <name>PORT5_IRQ</name>
            <description>Port5 Interrupt</description>
            <value>39</value>
        </interrupt>
        <interrupt>
            <name>PORT6_IRQ</name>
            <description>Port6 Interrupt</description>
            <value>40</value>
        </interrupt>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x138</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                  <name>PAIN</name>
                  <displayName>PAIN</displayName>
                  <description>Port A Input</description>
                  <addressOffset>0x0</addressOffset>
                  <size>16</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000000</resetMask>
                  <fields>
                    <field>
                        <name>P1IN</name>
                        <description>Port 1 Input</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>P2IN</name>
                        <description>Port 2 Input</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PAOUT</name>
                  <displayName>PAOUT</displayName>
                  <description>Port A Output</description>
                  <addressOffset>0x2</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000000</resetMask>
                  <fields>
                    <field>
                        <name>P2OUT</name>
                        <description>Port 2 Output</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P1OUT</name>
                        <description>Port 1 Output</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PADIR</name>
                  <displayName>PADIR</displayName>
                  <description>Port A Direction</description>
                  <addressOffset>0x4</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P1DIR</name>
                        <description>Port 1 Direction</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P2DIR</name>
                        <description>Port 2 Direction</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PAREN</name>
                  <displayName>PAREN</displayName>
                  <description>Port A Resistor Enable</description>
                  <addressOffset>0x6</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P1REN</name>
                        <description>Port 1 Resistor Enable</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P2REN</name>
                        <description>Port 2 Resistor Enable</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PADS</name>
                  <displayName>PADS</displayName>
                  <description>Port A Drive Strength</description>
                  <addressOffset>0x8</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>P1DS</name>
                        <description>Port 1 Drive Strength</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P2DS</name>
                        <description>Port 2 Drive Strength</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PASEL0</name>
                  <displayName>PASEL0</displayName>
                  <description>Port A Select 0</description>
                  <addressOffset>0xA</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P1SEL0</name>
                        <description>Port 1 Select 0</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P2SEL0</name>
                        <description>Port 2 Select 0</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PASEL1</name>
                  <displayName>PASEL1</displayName>
                  <description>Port A Select 1</description>
                  <addressOffset>0xC</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P1SEL1</name>
                        <description>Port 1 Select 1</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P2SEL1</name>
                        <description>Port 2 Select 1</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>P1IV</name>
                  <displayName>P1IV</displayName>
                  <description>Port 1 Interrupt Vector Register</description>
                  <addressOffset>0xE</addressOffset>
                  <size>16</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P1IV</name>
                        <description>Port 1 interrupt vector value</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x5</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>P1IV_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>P1IV_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P1IV_2</name>
                                <description>Interrupt Source: Port 1.0 interrupt; Interrupt Flag: P1IFG0; Interrupt Priority: Highest</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P1IV_4</name>
                                <description>Interrupt Source: Port 1.1 interrupt; Interrupt Flag: P1IFG1</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P1IV_6</name>
                                <description>Interrupt Source: Port 1.2 interrupt; Interrupt Flag: P1IFG2</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P1IV_8</name>
                                <description>Interrupt Source: Port 1.3 interrupt; Interrupt Flag: P1IFG3</description>
                                <value>8</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P1IV_10</name>
                                <description>Interrupt Source: Port 1.4 interrupt; Interrupt Flag: P1IFG4</description>
                                <value>10</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P1IV_12</name>
                                <description>Interrupt Source: Port 1.5 interrupt; Interrupt Flag: P1IFG5</description>
                                <value>12</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P1IV_14</name>
                                <description>Interrupt Source: Port 1.6 interrupt; Interrupt Flag: P1IFG6</description>
                                <value>14</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P1IV_16</name>
                                <description>Interrupt Source: Port 1.7 interrupt; Interrupt Flag: P1IFG7; Interrupt Priority: Lowest</description>
                                <value>16</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PASELC</name>
                  <displayName>PASELC</displayName>
                  <description>Port A Complement Select</description>
                  <addressOffset>0x16</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P1SELC</name>
                        <description>Port 1 Complement Select</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P2SELC</name>
                        <description>Port 2 Complement Select</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PAIES</name>
                  <displayName>PAIES</displayName>
                  <description>Port A Interrupt Edge Select</description>
                  <addressOffset>0x18</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000000</resetMask>
                  <fields>
                    <field>
                        <name>P1IES</name>
                        <description>Port 1 Interrupt Edge Select</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P2IES</name>
                        <description>Port 2 Interrupt Edge Select</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PAIE</name>
                  <displayName>PAIE</displayName>
                  <description>Port A Interrupt Enable</description>
                  <addressOffset>0x1A</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P1IE</name>
                        <description>Port 1 Interrupt Enable</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P2IE</name>
                        <description>Port 2 Interrupt Enable</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PAIFG</name>
                  <displayName>PAIFG</displayName>
                  <description>Port A Interrupt Flag</description>
                  <addressOffset>0x1C</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P1IFG</name>
                        <description>Port 1 Interrupt Flag</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P2IFG</name>
                        <description>Port 2 Interrupt Flag</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>P2IV</name>
                  <displayName>P2IV</displayName>
                  <description>Port 2 Interrupt Vector Register</description>
                  <addressOffset>0x1E</addressOffset>
                  <size>16</size>
                  <access>read-only</access>
                  <fields>
                    <field>
                        <name>P2IV</name>
                        <description>Port 2 interrupt vector value</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x5</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>P2IV_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>P2IV_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P2IV_2</name>
                                <description>Interrupt Source: Port 2.0 interrupt; Interrupt Flag: P2IFG0; Interrupt Priority: Highest</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P2IV_4</name>
                                <description>Interrupt Source: Port 2.1 interrupt; Interrupt Flag: P2IFG1</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P2IV_6</name>
                                <description>Interrupt Source: Port 2.2 interrupt; Interrupt Flag: P2IFG2</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P2IV_8</name>
                                <description>Interrupt Source: Port 2.3 interrupt; Interrupt Flag: P2IFG3</description>
                                <value>8</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P2IV_10</name>
                                <description>Interrupt Source: Port 2.4 interrupt; Interrupt Flag: P2IFG4</description>
                                <value>10</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P2IV_12</name>
                                <description>Interrupt Source: Port 2.5 interrupt; Interrupt Flag: P2IFG5</description>
                                <value>12</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P2IV_14</name>
                                <description>Interrupt Source: Port 2.6 interrupt; Interrupt Flag: P2IFG6</description>
                                <value>14</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P2IV_16</name>
                                <description>Interrupt Source: Port 2.7 interrupt; Interrupt Flag: P2IFG7; Interrupt Priority: Lowest</description>
                                <value>16</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PBIN</name>
                  <displayName>PBIN</displayName>
                  <description>Port B Input</description>
                  <addressOffset>0x20</addressOffset>
                  <size>16</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000000</resetMask>
                  <fields>
                    <field>
                        <name>P3IN</name>
                        <description>Port 3 Input</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>P4IN</name>
                        <description>Port 4 Input</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
