cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P4011.svd
levels as follows:
Bit [7] Controls HPROT[3] to indicate if a cacheable access is occurring.
Bit [6] Controls HPROT[2] to indicate if a bufferable access is occurring.
Bit [5] Controls HPROT[1] to indicate if a privileged access is occurring.
Note: When bit [n] = 1 then the corresponding HPROT is HIGH.
When bit [n] = 0 then the corresponding HPROT is LOW.</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x3</bitWidth>
                        <access>write-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>DMA_CTLBASE</name>
                  <displayName>CTLBASE</displayName>
                  <description>Channel Control Data Base Pointer Register</description>
                  <addressOffset>0x1008</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>ADDR</name>
                        <description>Pointer to the base address of the primary data structure.</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1B</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>DMA_ALTBASE</name>
                  <displayName>ALTBASE</displayName>
                  <description>Channel Alternate Control Data Base Pointer Register</description>
                  <addressOffset>0x100C</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffff00</resetMask>
                  <fields>
                    <field>
                        <name>ADDR</name>
                        <description>Base address of the alternate data structure</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>DMA_WAITSTAT</name>
                  <displayName>WAITSTAT</displayName>
                  <description>Channel Wait on Request Status Register</description>
                  <addressOffset>0x1010</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>WAITREQ</name>
                        <description>Channel wait on request status.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>WAITREQ_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>WAITREQ_0</name>
                                <description>dma_waitonreq[C] is LOW.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>WAITREQ_1</name>
                                <description>dma_waitonreq[C] is HIGH.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>DMA_SWREQ</name>
                  <displayName>SWREQ</displayName>
                  <description>Channel Software Request Register</description>
                  <addressOffset>0x1014</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000000</resetMask>
                  <fields>
                    <field>
                        <name>CHNL_SW_REQ</name>
                        <description>Set the appropriate bit to generate a software DMA request on the
corresponding DMA channel.
Writing to a bit where a DMA channel is not implemented does not
create a DMA request for that channel.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CHNL_SW_REQ_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CHNL_SW_REQ_0</name>
                                <description>Does not create a DMA request for the channel</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CHNL_SW_REQ_1</name>
                                <description>Creates a DMA request for the channel</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>DMA_USEBURSTSET</name>
                  <displayName>USEBURSTSET</displayName>
                  <description>Channel Useburst Set Register</description>
                  <addressOffset>0x1018</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>SET</name>
                        <description>Returns the useburst status, or disables dma_sreq from generating DMA requests.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <name>SET_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>SET_0_READ</name>
                                <description>DMA channel C responds to requests that it receives on dma_req[C] or dma_sreq[C].
The controller performs 2R, or single, bus transfers.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SET_1_READ</name>
                                <description>DMA channel C does not respond to requests that it receives on dma_sreq[C].
The controller only responds to dma_req[C] requests and performs 2R transfers.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                        <enumeratedValues>
                            <name>SET_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>SET_0_WRITE</name>
                                <description>No effect. Use the DMA_USEBURST_CLR Register to set bit [C] to 0.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SET_1_WRITE</name>
                                <description>Disables dma_sreq[C] from generating DMA requests.
The controller performs 2R transfers.
