cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P4011.svd
Writing to a bit where a DMA channel is not implemented has no effect.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>DMA_ALTCLR</name>
                  <displayName>ALTCLR</displayName>
                  <description>Channel Primary-Alternate Clear Register</description>
                  <addressOffset>0x1034</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000000</resetMask>
                  <fields>
                    <field>
                        <name>CLR</name>
                        <description>Channel Primary-Alternate Clear Register</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLR_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLR_0</name>
                                <description>No effect.
Use the DMA_ALTSET Register to select the alternate data structure.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLR_1</name>
                                <description>Selects the primary data structure for channel C.
Writing to a bit where a DMA channel is not implemented has no effect.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>DMA_PRIOSET</name>
                  <displayName>PRIOSET</displayName>
                  <description>Channel Priority Set Register</description>
                  <addressOffset>0x1038</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>SET</name>
                        <description>Returns the channel priority mask status, or sets the channel priority
to high.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <name>SET_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>SET_0_READ</name>
                                <description>DMA channel C is using the default priority level.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SET_1_READ</name>
                                <description>DMA channel C is using a high priority level.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                        <enumeratedValues>
                            <name>SET_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>SET_0_WRITE</name>
                                <description>No effect.
Use the DMA_PRIOCLR Register to set channel C to the default priority level.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SET_1_WRITE</name>
                                <description>Channel C uses the high priority level.
Writing to a bit where a DMA channel is not implemented has no effect.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>DMA_PRIOCLR</name>
                  <displayName>PRIOCLR</displayName>
                  <description>Channel Priority Clear Register</description>
                  <addressOffset>0x103C</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000000</resetMask>
                  <fields>
                    <field>
                        <name>CLR</name>
                        <description>Set the appropriate bit to select the default priority level for the
specified DMA channel.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLR_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLR_0</name>
                                <description>No effect.
Use the DMA_PRIOSET Register to set channel C to the high priority level.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLR_1</name>
                                <description>Channel C uses the default priority level.
