cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P4011.svd
Writing to a bit where a DMA channel is not implemented has no effect.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>DMA_ERRCLR</name>
                  <displayName>ERRCLR</displayName>
                  <description>Bus Error Clear Register</description>
                  <addressOffset>0x104C</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>ERRCLR</name>
                        <description>Returns the status of dma_err, or sets the signal LOW.

For test purposes, use the ERRSET register to set dma_err HIGH.
Note: If you deassert dma_err at the same time as an ERROR
occurs on the AHB-Lite bus, then the ERROR condition takes
precedence and dma_err remains asserted.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <name>ERRCLR_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ERRCLR_0_READ</name>
                                <description>dma_err is LOW</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ERRCLR_1_READ</name>
                                <description>dma_err is HIGH.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                        <enumeratedValues>
                            <name>ERRCLR_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>ERRCLR_0_WRITE</name>
                                <description>No effect, status of dma_err is unchanged.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ERRCLR_1_WRITE</name>
                                <description>Sets dma_err LOW.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
        </registers>
    </peripheral>
    <peripheral>
        <name>PCM</name>
        <version>356.0</version>
        <description>PCM</description>
        <baseAddress>0x40010000</baseAddress>
        <interrupt>
            <name>PCM_IRQ</name>
            <description>PCM Interrupt</description>
            <value>2</value>
        </interrupt>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x14</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                  <name>PCMCTL0</name>
                  <displayName>CTL0</displayName>
                  <description>Control 0 Register</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0xa5960000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>AMR</name>
                        <description>Active Mode Request</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>AMR_0</name>
                                <description>LDO based Active Mode at Core voltage setting 0.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>AMR_1</name>
                                <description>LDO based Active Mode at Core voltage setting 1.</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>AMR_4</name>
                                <description>DC-DC based Active Mode at Core voltage setting 0.</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>AMR_5</name>
                                <description>DC-DC based Active Mode at Core voltage setting 1.</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>AMR_8</name>
                                <description>Low-Frequency Active Mode at Core voltage setting 0.</description>
                                <value>8</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>AMR_9</name>
                                <description>Low-Frequency Active Mode at Core voltage setting 1.</description>
                                <value>9</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LPMR</name>
                        <description>Low Power Mode Request</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LPMR_0</name>
                                <description>LPM3. Core voltage setting is similar to the mode from which LPM3 is entered.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LPMR_10</name>
                                <description>LPM3.5. Core voltage setting 0.</description>
                                <value>10</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LPMR_12</name>
                                <description>LPM4.5</description>
                                <value>12</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CPM</name>
                        <description>Current Power Mode</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x6</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>CPM_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>CPM_0</name>
                                <description>LDO based Active Mode at Core voltage setting 0.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CPM_1</name>
                                <description>LDO based Active Mode at Core voltage setting 1.</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CPM_4</name>
                                <description>DC-DC based Active Mode at Core voltage setting 0.</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CPM_5</name>
                                <description>DC-DC based Active Mode at Core voltage setting 1.</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CPM_8</name>
                                <description>Low-Frequency Active Mode at Core voltage setting 0.</description>
                                <value>8</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CPM_9</name>
                                <description>Low-Frequency Active Mode at Core voltage setting 1.</description>
                                <value>9</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CPM_16</name>
                                <description>LDO based LPM0 at Core voltage setting 0.</description>
                                <value>16</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CPM_17</name>
                                <description>LDO based LPM0 at Core voltage setting 1.</description>
                                <value>17</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CPM_20</name>
                                <description>DC-DC based LPM0 at Core voltage setting 0.</description>
                                <value>20</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CPM_21</name>
                                <description>DC-DC based LPM0 at Core voltage setting 1.</description>
                                <value>21</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CPM_24</name>
                                <description>Low-Frequency LPM0 at Core voltage setting 0.</description>
                                <value>24</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CPM_25</name>
                                <description>Low-Frequency LPM0 at Core voltage setting 1.</description>
                                <value>25</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CPM_32</name>
                                <description>LPM3</description>
                                <value>32</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PCMKEY</name>
                        <description>PCM key</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PCMCTL1</name>
                  <displayName>CTL1</displayName>
                  <description>Control 1 Register</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0xa5960000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>LOCKLPM5</name>
                        <description>Lock LPM5</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LOCKLPM5_0</name>
                                <description>LPMx.5 configuration defaults to reset condition</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LOCKLPM5_1</name>
                                <description>LPMx.5 configuration remains locked during LPMx.5 entry and exit</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LOCKBKUP</name>
                        <description>Lock Backup</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LOCKBKUP_0</name>
                                <description>Backup domain configuration defaults to reset condition</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LOCKBKUP_1</name>
                                <description>Backup domain configuration remains locked during LPM3.5 entry and exit</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>FORCE_LPM_ENTRY</name>
                        <description>Force LPM entry</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>FORCE_LPM_ENTRY_0</name>
                                <description>PCM aborts LPM3/LPMx.5 transition if the active clock configuration does not meet the LPM3/LPMx.5 entry criteria. PCM generates the LPM_INVALID_CLK flag on abort to LPM3/LPMx.5 entry.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>FORCE_LPM_ENTRY_1</name>
                                <description>PCM enters LPM3/LPMx.5 after shuting off the clocks forcefully. Application needs to ensure RTC and WDT are clocked using BCLK tree to keep these modules alive in LPM3/LPM3.5. In LPM4.5 all clocks are forcefully shutoff and the core voltage is turned off.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PMR_BUSY</name>
                        <description>Power mode request busy flag</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PCMKEY</name>
                        <description>PCM key</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PCMIE</name>
                  <displayName>IE</displayName>
                  <description>Interrupt Enable Register</description>
                  <addressOffset>0x8</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>LPM_INVALID_TR_IE</name>
                        <description>LPM invalid transition interrupt enable</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LPM_INVALID_TR_IE_0</name>
                                <description>Disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LPM_INVALID_TR_IE_1</name>
                                <description>Enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LPM_INVALID_CLK_IE</name>
                        <description>LPM invalid clock interrupt enable</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LPM_INVALID_CLK_IE_0</name>
                                <description>Disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LPM_INVALID_CLK_IE_1</name>
                                <description>Enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>AM_INVALID_TR_IE</name>
                        <description>Active mode invalid transition interrupt enable</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>AM_INVALID_TR_IE_0</name>
                                <description>Disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>AM_INVALID_TR_IE_1</name>
                                <description>Enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>DCDC_ERROR_IE</name>
                        <description>DC-DC error interrupt enable</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>DCDC_ERROR_IE_0</name>
                                <description>Disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DCDC_ERROR_IE_1</name>
                                <description>Enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PCMIFG</name>
                  <displayName>IFG</displayName>
                  <description>Interrupt Flag Register</description>
                  <addressOffset>0xC</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>LPM_INVALID_TR_IFG</name>
                        <description>LPM invalid transition flag</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>LPM_INVALID_CLK_IFG</name>
                        <description>LPM invalid clock flag</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>AM_INVALID_TR_IFG</name>
                        <description>Active mode invalid transition flag</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DCDC_ERROR_IFG</name>
                        <description>DC-DC error flag</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
