cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P4011.svd
            <register>
                  <name>FLCTL_BANK1_MAIN_WEPROT</name>
                  <displayName>BANK1_MAIN_WEPROT</displayName>
                  <description>Main Memory Bank1 Write/Erase Protection Register</description>
                  <addressOffset>0xC4</addressOffset>
                  <size>32</size>
                  <resetValue>0xffffffff</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>PROT0</name>
                        <description>Protects Sector 0 from program or erase operations</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROT1</name>
                        <description>Protects Sector 1 from program or erase operations</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROT2</name>
                        <description>Protects Sector 2 from program or erase operations</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROT3</name>
                        <description>Protects Sector 3 from program or erase operations</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROT4</name>
                        <description>Protects Sector 4 from program or erase operations</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROT5</name>
                        <description>Protects Sector 5 from program or erase operations</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROT6</name>
                        <description>Protects Sector 6 from program or erase operations</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROT7</name>
                        <description>Protects Sector 7 from program or erase operations</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROT8</name>
                        <description>Protects Sector 8 from program or erase operations</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROT9</name>
                        <description>Protects Sector 9 from program or erase operations</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROT10</name>
                        <description>Protects Sector 10 from program or erase operations</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROT11</name>
                        <description>Protects Sector 11 from program or erase operations</description>
                        <bitOffset>0xB</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROT12</name>
                        <description>Protects Sector 12 from program or erase operations</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROT13</name>
                        <description>Protects Sector 13 from program or erase operations</description>
                        <bitOffset>0xD</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROT14</name>
                        <description>Protects Sector 14 from program or erase operations</description>
                        <bitOffset>0xE</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROT15</name>
                        <description>Protects Sector 15 from program or erase operations</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROT16</name>
                        <description>Protects Sector 16 from program or erase operations</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROT17</name>
                        <description>Protects Sector 17 from program or erase operations</description>
                        <bitOffset>0x11</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROT18</name>
                        <description>Protects Sector 18 from program or erase operations</description>
                        <bitOffset>0x12</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROT19</name>
                        <description>Protects Sector 19 from program or erase operations</description>
                        <bitOffset>0x13</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROT20</name>
                        <description>Protects Sector 20 from program or erase operations</description>
                        <bitOffset>0x14</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROT21</name>
                        <description>Protects Sector 21 from program or erase operations</description>
                        <bitOffset>0x15</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROT22</name>
                        <description>Protects Sector 22 from program or erase operations</description>
                        <bitOffset>0x16</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROT23</name>
                        <description>Protects Sector 23 from program or erase operations</description>
                        <bitOffset>0x17</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROT24</name>
                        <description>Protects Sector 24 from program or erase operations</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROT25</name>
                        <description>Protects Sector 25 from program or erase operations</description>
                        <bitOffset>0x19</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROT26</name>
                        <description>Protects Sector 26 from program or erase operations</description>
                        <bitOffset>0x1A</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROT27</name>
                        <description>Protects Sector 27 from program or erase operations</description>
                        <bitOffset>0x1B</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROT28</name>
                        <description>Protects Sector 28 from program or erase operations</description>
                        <bitOffset>0x1C</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROT29</name>
                        <description>Protects Sector 29 from program or erase operations</description>
                        <bitOffset>0x1D</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROT30</name>
                        <description>Protects Sector 30 from program or erase operations</description>
                        <bitOffset>0x1E</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PROT31</name>
                        <description>Protects Sector 31 from program or erase operations</description>
                        <bitOffset>0x1F</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_BMRK_CTLSTAT</name>
                  <displayName>BMRK_CTLSTAT</displayName>
                  <description>Benchmark Control and Status Register</description>
                  <addressOffset>0xD0</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>I_BMRK</name>
                        <description>When 1, increments the Instruction Benchmark count register on each instruction fetch to the Flash</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>D_BMRK</name>
                        <description>When 1, increments the Data Benchmark count register on each data read access to the Flash</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CMP_EN</name>
                        <description>When 1, enables comparison of the Instruction or Data Benchmark Registers against the threshold value</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CMP_SEL</name>
                        <description>Selects which benchmark register should be compared against the threshold</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_1_0x0</name>
                                <description>Compares the Instruction Benchmark Register against the threshold value</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_2_0x1</name>
                                <description>Compares the Data Benchmark Register against the threshold value</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_BMRK_IFETCH</name>
                  <displayName>BMRK_IFETCH</displayName>
                  <description>Benchmark Instruction Fetch Count Register</description>
                  <addressOffset>0xD4</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>COUNT</name>
                        <description>Reflects the number of Instruction Fetches to the Flash (increments by one on each fetch)</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_BMRK_DREAD</name>
                  <displayName>BMRK_DREAD</displayName>
                  <description>Benchmark Data Read Count Register</description>
                  <addressOffset>0xD8</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>COUNT</name>
                        <description>Reflects the number of Data Read operations to the Flash (increments by one on each read)</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_BMRK_CMP</name>
                  <displayName>BMRK_CMP</displayName>
                  <description>Benchmark Count Compare Register</description>
                  <addressOffset>0xDC</addressOffset>
                  <size>32</size>
                  <resetValue>0x00010000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>COUNT</name>
                        <description>Reflects the threshold value that is compared against either the IFETCH or DREAD Benchmark Counters</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FLCTL_IFG</name>
                  <displayName>IFG</displayName>
                  <description>Interrupt Flag Register</description>
                  <addressOffset>0xF0</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>RDBRST</name>
                        <description>If set to 1, indicates that the Read Burst/Compare operation is complete</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>AVPRE</name>
                        <description>If set to 1, indicates that the pre-program verify operation has detected an error</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>AVPST</name>
                        <description>If set to 1, indicates that the post-program verify operation has failed comparison</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PRG</name>
                        <description>If set to 1, indicates that a word Program operation is complete</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PRGB</name>
                        <description>If set to 1, indicates that the configured Burst Program operation is complete</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ERASE</name>
                        <description>If set to 1, indicates that the Erase operation is complete</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>BMRK</name>
                        <description>If set to 1, indicates that a Benchmark Compare match occurred</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PRG_ERR</name>
                        <description>If set to 1, indicates a word composition error in full word write mode (possible data loss due to writes crossing over to a new 128bit boundary before full word has been composed)</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
