cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P4011.svd
            <register>
                  <name>ADC14CLRIFGR0</name>
                  <displayName>CLRIFGR0</displayName>
                  <description>Clear Interrupt Flag 0 Register</description>
                  <addressOffset>0x14C</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>CLRADC14IFG0</name>
                        <description>clear ADC14IFG0</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLRADC14IFG0_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLRADC14IFG0_0</name>
                                <description>no effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRADC14IFG0_1</name>
                                <description>clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRADC14IFG1</name>
                        <description>clear ADC14IFG1</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLRADC14IFG1_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLRADC14IFG1_0</name>
                                <description>no effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRADC14IFG1_1</name>
                                <description>clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRADC14IFG2</name>
                        <description>clear ADC14IFG2</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLRADC14IFG2_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLRADC14IFG2_0</name>
                                <description>no effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRADC14IFG2_1</name>
                                <description>clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRADC14IFG3</name>
                        <description>clear ADC14IFG3</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLRADC14IFG3_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLRADC14IFG3_0</name>
                                <description>no effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRADC14IFG3_1</name>
                                <description>clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRADC14IFG4</name>
                        <description>clear ADC14IFG4</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLRADC14IFG4_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLRADC14IFG4_0</name>
                                <description>no effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRADC14IFG4_1</name>
                                <description>clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRADC14IFG5</name>
                        <description>clear ADC14IFG5</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLRADC14IFG5_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLRADC14IFG5_0</name>
                                <description>no effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRADC14IFG5_1</name>
                                <description>clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRADC14IFG6</name>
                        <description>clear ADC14IFG6</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLRADC14IFG6_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLRADC14IFG6_0</name>
                                <description>no effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRADC14IFG6_1</name>
                                <description>clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRADC14IFG7</name>
                        <description>clear ADC14IFG7</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLRADC14IFG7_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLRADC14IFG7_0</name>
                                <description>no effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRADC14IFG7_1</name>
                                <description>clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRADC14IFG8</name>
                        <description>clear ADC14IFG8</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLRADC14IFG8_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLRADC14IFG8_0</name>
                                <description>no effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRADC14IFG8_1</name>
                                <description>clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRADC14IFG9</name>
                        <description>clear ADC14IFG9</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLRADC14IFG9_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLRADC14IFG9_0</name>
                                <description>no effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRADC14IFG9_1</name>
                                <description>clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRADC14IFG10</name>
                        <description>clear ADC14IFG10</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLRADC14IFG10_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLRADC14IFG10_0</name>
                                <description>no effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRADC14IFG10_1</name>
                                <description>clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRADC14IFG11</name>
                        <description>clear ADC14IFG11</description>
                        <bitOffset>0xB</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLRADC14IFG11_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLRADC14IFG11_0</name>
                                <description>no effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRADC14IFG11_1</name>
                                <description>clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRADC14IFG12</name>
                        <description>clear ADC14IFG12</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLRADC14IFG12_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLRADC14IFG12_0</name>
                                <description>no effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRADC14IFG12_1</name>
                                <description>clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRADC14IFG13</name>
                        <description>clear ADC14IFG13</description>
                        <bitOffset>0xD</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLRADC14IFG13_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLRADC14IFG13_0</name>
                                <description>no effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRADC14IFG13_1</name>
                                <description>clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRADC14IFG14</name>
                        <description>clear ADC14IFG14</description>
                        <bitOffset>0xE</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLRADC14IFG14_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLRADC14IFG14_0</name>
                                <description>no effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRADC14IFG14_1</name>
                                <description>clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRADC14IFG15</name>
                        <description>clear ADC14IFG15</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLRADC14IFG15_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLRADC14IFG15_0</name>
                                <description>no effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRADC14IFG15_1</name>
                                <description>clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRADC14IFG16</name>
                        <description>clear ADC14IFG16</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLRADC14IFG16_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLRADC14IFG16_0</name>
                                <description>no effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRADC14IFG16_1</name>
                                <description>clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRADC14IFG17</name>
                        <description>clear ADC14IFG17</description>
                        <bitOffset>0x11</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLRADC14IFG17_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLRADC14IFG17_0</name>
                                <description>no effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRADC14IFG17_1</name>
                                <description>clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRADC14IFG18</name>
                        <description>clear ADC14IFG18</description>
                        <bitOffset>0x12</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLRADC14IFG18_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLRADC14IFG18_0</name>
                                <description>no effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRADC14IFG18_1</name>
                                <description>clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRADC14IFG19</name>
                        <description>clear ADC14IFG19</description>
                        <bitOffset>0x13</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLRADC14IFG19_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLRADC14IFG19_0</name>
                                <description>no effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRADC14IFG19_1</name>
                                <description>clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRADC14IFG20</name>
                        <description>clear ADC14IFG20</description>
                        <bitOffset>0x14</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLRADC14IFG20_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLRADC14IFG20_0</name>
                                <description>no effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRADC14IFG20_1</name>
                                <description>clear pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRADC14IFG21</name>
                        <description>clear ADC14IFG21</description>
