cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P4011.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>FPB</name>
        <version>356.0</version>
        <description>FPB</description>
        <baseAddress>0xE0002000</baseAddress>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x1000</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                  <name>FP_CTRL</name>
                  <displayName>FP_CTRL</displayName>
                  <description>Flash Patch Control Register</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000130</resetValue>
                  <fields>
                    <field>
                        <name>ENABLE</name>
                        <description>Flash patch unit enable bit</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0</name>
                                <description>flash patch unit disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1</name>
                                <description>flash patch unit enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>KEY</name>
                        <description>Key field. To write to the Flash Patch Control Register, you must write a 1 to this write-only bit.</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>NUM_CODE1</name>
                        <description>Number of code slots field.</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>no code slots</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0010</name>
                                <description>two code slots</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0110</name>
                                <description>six code slots</description>
                                <value>6</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>NUM_LIT</name>
                        <description>Number of literal slots field.</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>no literal slots</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0010</name>
                                <description>two literal slots</description>
                                <value>2</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>NUM_CODE2</name>
                        <description>Number of full banks of code comparators, sixteen comparators per bank. Where less than sixteen code comparators are provided, the bank count is zero, and the number present indicated by NUM_CODE. This read only field contains 3'b000 to indicate 0 banks for Cortex-M4 processor.</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FP_REMAP</name>
                  <displayName>FP_REMAP</displayName>
                  <description>Flash Patch Remap Register</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>REMAP</name>
                        <description>Remap base address field.</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x18</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FP_COMP0</name>
                  <displayName>FP_COMP0</displayName>
                  <description>Flash Patch Comparator Registers</description>
                  <addressOffset>0x8</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000001</resetMask>
                  <fields>
                    <field>
                        <name>ENABLE</name>
                        <description>Compare and remap enable for Flash Patch Comparator Register 0. The ENABLE bit of FP_CTRL must also be set to enable comparisons. Reset clears the ENABLE bit.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0</name>
                                <description>Flash Patch Comparator Register 0 compare and remap disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1</name>
                                <description>Flash Patch Comparator Register 0 compare and remap enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>COMP</name>
                        <description>Comparison address.</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1B</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>REPLACE</name>
                        <description>This selects what happens when the COMP address is matched. Settings other than b00 are only valid for instruction comparators. Literal comparators ignore non-b00 settings. Address remapping only takes place for the b00 setting.</description>
                        <bitOffset>0x1E</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b00</name>
                                <description>remap to remap address. See FP_REMAP</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b01</name>
                                <description>set BKPT on lower halfword, upper is unaffected</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b10</name>
                                <description>set BKPT on upper halfword, lower is unaffected</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b11</name>
                                <description>set BKPT on both lower and upper halfwords.</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FP_COMP1</name>
                  <displayName>FP_COMP1</displayName>
                  <description>Flash Patch Comparator Registers</description>
                  <addressOffset>0xC</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000001</resetMask>
                  <fields>
                    <field>
                        <name>ENABLE</name>
                        <description>Compare and remap enable for Flash Patch Comparator Register 1. The ENABLE bit of FP_CTRL must also be set to enable comparisons. Reset clears the ENABLE bit.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0</name>
                                <description>Flash Patch Comparator Register 1 compare and remap disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1</name>
                                <description>Flash Patch Comparator Register 1 compare and remap enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>COMP</name>
                        <description>Comparison address.</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1B</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>REPLACE</name>
                        <description>This selects what happens when the COMP address is matched. Settings other than b00 are only valid for instruction comparators. Literal comparators ignore non-b00 settings. Address remapping only takes place for the b00 setting.</description>
                        <bitOffset>0x1E</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b00</name>
                                <description>remap to remap address. See FP_REMAP</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b01</name>
                                <description>set BKPT on lower halfword, upper is unaffected</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b10</name>
                                <description>set BKPT on upper halfword, lower is unaffected</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b11</name>
                                <description>set BKPT on both lower and upper halfwords.</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FP_COMP2</name>
                  <displayName>FP_COMP2</displayName>
                  <description>Flash Patch Comparator Registers</description>
                  <addressOffset>0x10</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000001</resetMask>
                  <fields>
                    <field>
                        <name>ENABLE</name>
                        <description>Compare and remap enable for Flash Patch Comparator Register 2. The ENABLE bit of FP_CTRL must also be set to enable comparisons. Reset clears the ENABLE bit.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0</name>
                                <description>Flash Patch Comparator Register 2 compare and remap disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1</name>
                                <description>Flash Patch Comparator Register 2 compare and remap enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>COMP</name>
                        <description>Comparison address.</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1B</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>REPLACE</name>
                        <description>This selects what happens when the COMP address is matched. Settings other than b00 are only valid for instruction comparators. Literal comparators ignore non-b00 settings. Address remapping only takes place for the b00 setting.</description>
                        <bitOffset>0x1E</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b00</name>
                                <description>remap to remap address. See FP_REMAP</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b01</name>
                                <description>set BKPT on lower halfword, upper is unaffected</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b10</name>
                                <description>set BKPT on upper halfword, lower is unaffected</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b11</name>
                                <description>set BKPT on both lower and upper halfwords.</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FP_COMP3</name>
                  <displayName>FP_COMP3</displayName>
                  <description>Flash Patch Comparator Registers</description>
                  <addressOffset>0x14</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000001</resetMask>
                  <fields>
                    <field>
                        <name>ENABLE</name>
                        <description>Compare and remap enable for Flash Patch Comparator Register 3. The ENABLE bit of FP_CTRL must also be set to enable comparisons. Reset clears the ENABLE bit.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0</name>
                                <description>Flash Patch Comparator Register 3 compare and remap disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1</name>
                                <description>Flash Patch Comparator Register 3 compare and remap enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>COMP</name>
                        <description>Comparison address.</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1B</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>REPLACE</name>
                        <description>This selects what happens when the COMP address is matched. Settings other than b00 are only valid for instruction comparators. Literal comparators ignore non-b00 settings. Address remapping only takes place for the b00 setting.</description>
                        <bitOffset>0x1E</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b00</name>
                                <description>remap to remap address. See FP_REMAP</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b01</name>
                                <description>set BKPT on lower halfword, upper is unaffected</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b10</name>
                                <description>set BKPT on upper halfword, lower is unaffected</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b11</name>
                                <description>set BKPT on both lower and upper halfwords.</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
