cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P4011.svd
            <register>
                  <name>FP_COMP4</name>
                  <displayName>FP_COMP4</displayName>
                  <description>Flash Patch Comparator Registers</description>
                  <addressOffset>0x18</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000001</resetMask>
                  <fields>
                    <field>
                        <name>ENABLE</name>
                        <description>Compare and remap enable for Flash Patch Comparator Register 4. The ENABLE bit of FP_CTRL must also be set to enable comparisons. Reset clears the ENABLE bit.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0</name>
                                <description>Flash Patch Comparator Register 4 compare and remap disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1</name>
                                <description>Flash Patch Comparator Register 4 compare and remap enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>COMP</name>
                        <description>Comparison address.</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1B</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>REPLACE</name>
                        <description>This selects what happens when the COMP address is matched. Settings other than b00 are only valid for instruction comparators. Literal comparators ignore non-b00 settings. Address remapping only takes place for the b00 setting.</description>
                        <bitOffset>0x1E</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b00</name>
                                <description>remap to remap address. See FP_REMAP</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b01</name>
                                <description>set BKPT on lower halfword, upper is unaffected</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b10</name>
                                <description>set BKPT on upper halfword, lower is unaffected</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b11</name>
                                <description>set BKPT on both lower and upper halfwords.</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FP_COMP5</name>
                  <displayName>FP_COMP5</displayName>
                  <description>Flash Patch Comparator Registers</description>
                  <addressOffset>0x1C</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000001</resetMask>
                  <fields>
                    <field>
                        <name>ENABLE</name>
                        <description>Compare and remap enable for Flash Patch Comparator Register 5. The ENABLE bit of FP_CTRL must also be set to enable comparisons. Reset clears the ENABLE bit.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0</name>
                                <description>Flash Patch Comparator Register 5 compare and remap disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1</name>
                                <description>Flash Patch Comparator Register 5 compare and remap enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>COMP</name>
                        <description>Comparison address.</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1B</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>REPLACE</name>
                        <description>This selects what happens when the COMP address is matched. Settings other than b00 are only valid for instruction comparators. Literal comparators ignore non-b00 settings. Address remapping only takes place for the b00 setting.</description>
                        <bitOffset>0x1E</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b00</name>
                                <description>remap to remap address. See FP_REMAP</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b01</name>
                                <description>set BKPT on lower halfword, upper is unaffected</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b10</name>
                                <description>set BKPT on upper halfword, lower is unaffected</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b11</name>
                                <description>set BKPT on both lower and upper halfwords.</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FP_COMP6</name>
                  <displayName>FP_COMP6</displayName>
                  <description>Flash Patch Comparator Registers</description>
                  <addressOffset>0x20</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000001</resetMask>
                  <fields>
                    <field>
                        <name>ENABLE</name>
                        <description>Compare and remap enable for Flash Patch Comparator Register 6. The ENABLE bit of FP_CTRL must also be set to enable comparisons. Reset clears the ENABLE bit.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0</name>
                                <description>Flash Patch Comparator Register 6 compare and remap disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1</name>
                                <description>Flash Patch Comparator Register 6 compare and remap enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>COMP</name>
                        <description>Comparison address.</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1B</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>REPLACE</name>
                        <description>This selects what happens when the COMP address is matched. Settings other than b00 are only valid for instruction comparators. Literal comparators ignore non-b00 settings. Address remapping only takes place for the b00 setting.</description>
                        <bitOffset>0x1E</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b00</name>
                                <description>remap to remap address. See FP_REMAP</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b01</name>
                                <description>set BKPT on lower halfword, upper is unaffected</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b10</name>
                                <description>set BKPT on upper halfword, lower is unaffected</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b11</name>
                                <description>set BKPT on both lower and upper halfwords.</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FP_COMP7</name>
                  <displayName>FP_COMP7</displayName>
                  <description>Flash Patch Comparator Registers</description>
                  <addressOffset>0x24</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000001</resetMask>
                  <fields>
                    <field>
                        <name>ENABLE</name>
                        <description>Compare and remap enable for Flash Patch Comparator Register 7. The ENABLE bit of FP_CTRL must also be set to enable comparisons. Reset clears the ENABLE bit.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0</name>
                                <description>Flash Patch Comparator Register 7 compare and remap disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1</name>
                                <description>Flash Patch Comparator Register 7 compare and remap enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>COMP</name>
                        <description>Comparison address.</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1B</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>REPLACE</name>
                        <description>This selects what happens when the COMP address is matched. Settings other than b00 are only valid for instruction comparators. Literal comparators ignore non-b00 settings. Address remapping only takes place for the b00 setting.</description>
                        <bitOffset>0x1E</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b00</name>
                                <description>remap to remap address. See FP_REMAP</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b01</name>
                                <description>set BKPT on lower halfword, upper is unaffected</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b10</name>
                                <description>set BKPT on upper halfword, lower is unaffected</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b11</name>
                                <description>set BKPT on both lower and upper halfwords.</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
