cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P4011.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>SystemControlSpace</name>
        <version>356.0</version>
        <description>System Control Space for ARM core: SCnSCB, SCB, SysTick, NVIC, CoreDebug, MPU, FPU</description>
        <baseAddress>0xE000E000</baseAddress>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x1000</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                  <name>FPCCR</name>
                  <displayName>FPCCR</displayName>
                  <description>Floating Point Context Control Register</description>
                  <addressOffset>0xF34</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0xc0000000</resetValue>
                  <fields>
                    <field>
                        <name>ASPEN</name>
                        <description>Automatic State Preservation ENable. When this bit is set is will cause bit [2] of the Special CONTROL register to be set (FPCA) on execution of a floating point instruction which results in the floating point state automatically being preserved on exception entry.</description>
                        <bitOffset>0x1F</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LSPEN</name>
                        <description>Lazy State Preservation ENable. When the processor performs a context save, space on the stack is reserved for the floating point state but it is not stacked until the new context performs a floating point operation.</description>
                        <bitOffset>0x1E</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MONRDY</name>
                        <description>Indicates whether the the software executing when the processor allocated the FP stack frame was able to set the DebugMonitor exception to pending.</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BFRDY</name>
                        <description>Indicates whether the software executing when the processor allocated the FP stack frame was able to set the BusFault exception to pending.</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MMRDY</name>
                        <description>Indicates whether the software executing when the processor allocated the FP stack frame was able to set the MemManage exception to pending.</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>HFRDY</name>
                        <description>Indicates whether the software executing when the processor allocated the FP stack frame was able to set the HardFault exception to pending.</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>THREAD</name>
                        <description>Indicates the processor mode was Thread when it allocated the FP stack frame.</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>USER</name>
                        <description>Indicates the privilege level of the software executing was User (Unpriviledged) when the processor allocated the FP stack frame.</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LSPACT</name>
                        <description>Indicates whether Lazy preservation of the FP state is active.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FPCAR</name>
                  <displayName>FPCAR</displayName>
                  <description>Floating-Point Context Address Register</description>
                  <addressOffset>0xF38</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>ADDRESS</name>
                        <description>Holds the (double-word-aligned) location of the unpopulated floating-point register space allocated on an exception stack frame.</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1D</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>FPDSCR</name>
                  <displayName>FPDSCR</displayName>
                  <description>Floating Point Default Status Control Register</description>
                  <addressOffset>0xF3C</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>AHP</name>
                        <description>Default value for Alternative Half Precision bit. (If this bit is set to 1 then Alternative half-precision format is selected).</description>
                        <bitOffset>0x1A</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DN</name>
                        <description>Default value for Default NaN mode bit. (If this bit is set to 1 then any operation involving one or more NaNs returns the Default NaN).</description>
                        <bitOffset>0x19</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>FZ</name>
                        <description>Default value for Flush-to-Zero mode bit. (If this bit is set to 1 then Flush-to-zero mode is enabled).</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RMODE</name>
                        <description>Default value for Rounding Mode control field. (The encoding for this field is: 0b00 Round to Nearest (RN) mode, 0b01 Round towards Plus Infinity (RP) mode, 0b10 Round towards Minus Infinity (RM) mode, 0b11 Round towards Zero (RZ) mode. The specified rounding mode is used by almost all floating-point instructions).</description>
                        <bitOffset>0x16</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>MVFR0</name>
                  <displayName>MVFR0</displayName>
                  <description>Media and FP Feature Register 0 (MVFR0)</description>
                  <addressOffset>0xF40</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x10110021</resetValue>
                  <fields>
                    <field>
                        <name>FP_ROUNDING_MODES</name>
                        <description>Indicates the rounding modes supported by the FP floating-point hardware. The value of this field is: 0b0001 - all rounding modes supported.</description>
                        <bitOffset>0x1C</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SHORT_VECTORS</name>
                        <description>Indicates the hardware support for FP short vectors. The value of this field is: 0b0000 - not supported in ARMv7-M.</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SQUARE_ROOT</name>
                        <description>Indicates the hardware support for FP square root operations. The value of this field is: 0b0001 - supported.</description>
                        <bitOffset>0x14</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DIVIDE</name>
                        <description>Indicates the hardware support for FP divide operations. The value of this field is: 0b0001 - supported.</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>FP_EXCEPTION_TRAPPING</name>
                        <description>Indicates whether the FP hardware implementation supports exception trapping. The value of this field is: 0b0000 - not supported in ARMv7-M.</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DOUBLE_PRECISION</name>
                        <description>Indicates the hardware support for FP double-precision operations. The value of this field is: 0b0000 - not supported in ARMv7-M.</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SINGLE_PRECISION</name>
                        <description>Indicates the hardware support for FP single-precision operations. The value of this field is: 0b0010 - supported.</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>A_SIMD_REGISTERS</name>
                        <description>Indicates the size of the FP register bank. The value of this field is: 0b0001 - supported, 16 x 64-bit registers.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>MVFR1</name>
                  <displayName>MVFR1</displayName>
                  <description>Media and FP Feature Register 1 (MVFR1)</description>
                  <addressOffset>0xF44</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x11000011</resetValue>
                  <fields>
                    <field>
                        <name>FP_FUSED_MAC</name>
                        <description>Indicates whether the FP supports fused multiply accumulate operations. The value of this field is: 0b0001 - supported.</description>
                        <bitOffset>0x1C</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>FP_HPFP</name>
                        <description>Indicates whether the FP supports half-precision floating-point conversion operations. The value of this field is: 0b0001 - supported.</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>D_NAN_MODE</name>
                        <description>Indicates whether the FP hardware implementation supports only the Default NaN mode. The value of this field is: 0b0001 - hardware supports propagation of NaN values.</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>FTZ_MODE</name>
                        <description>Indicates whether the FP hardware implementation supports only the Flush-to-Zero mode of operation. The value of this field is: 0b0001 - hardware supports full denormalized number arithmetic.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
