cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P4011.svd
        </registers>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x1000</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                  <name>MPU_TYPE</name>
                  <displayName>TYPE</displayName>
                  <description>MPU Type Register</description>
                  <addressOffset>0xD90</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000800</resetValue>
                  <fields>
                    <field>
                        <name>SEPARATE</name>
                        <description>Because the processor core uses only a unified MPU, SEPARATE is always 0.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DREGION</name>
                        <description>Number of supported MPU regions field. DREGION contains 0x08 if the implementation contains an MPU indicating eight MPU regions, otherwise it contains 0x00.</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>IREGION</name>
                        <description>Because the processor core uses only a unified MPU, IREGION always contains 0x00.</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>MPU_CTRL</name>
                  <displayName>CTRL</displayName>
                  <description>MPU Control Register</description>
                  <addressOffset>0xD94</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>ENABLE</name>
                        <description>MPU enable bit. Reset clears the ENABLE bit.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0</name>
                                <description>disable MPU</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1</name>
                                <description>enable MPU</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>HFNMIENA</name>
                        <description>This bit enables the MPU when in Hard Fault, NMI, and FAULTMASK escalated handlers. If this bit = 1 and the ENABLE bit = 1, the MPU is enabled when in these handlers. If this bit = 0, the MPU is disabled when in these handlers, regardless of the value of ENABLE. If this bit =1 and ENABLE = 0, behavior is Unpredictable. Reset clears the HFNMIENA bit.</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRIVDEFENA</name>
                        <description>This bit enables the default memory map for privileged access, as a background region, when the MPU is enabled. The background region acts as if it was region number 1 before any settable regions. Any region that is set up overlays this default map, and overrides it. If this bit = 0, the default memory map is disabled, and memory not covered by a region faults. This applies to memory type, Execute Never (XN), cache and shareable rules. However, this only applies to privileged mode (fetch and data access). User mode code faults unless a region has been set up for its code and data. When the MPU is disabled, the default map acts on both privileged and user mode code. XN and SO rules always apply to the System partition whether this enable is set or not. If the MPU is disabled, this bit is ignored. Reset clears the PRIVDEFENA bit.</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>MPU_RNR</name>
                  <displayName>RNR</displayName>
                  <description>MPU Region Number Register</description>
                  <addressOffset>0xD98</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>REGION</name>
                        <description>Region select field. Selects the region to operate on when using the Region Attribute and Size Register and the Region Base Address Register. It must be written first except when the address VALID + REGION fields are written, which overwrites this.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>MPU_RBAR</name>
                  <displayName>RBAR</displayName>
                  <description>MPU Region Base Address Register</description>
                  <addressOffset>0xD9C</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>REGION</name>
                        <description>MPU region override field.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VALID</name>
                        <description>MPU Region Number valid bit.</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0</name>
                                <description>MPU Region Number Register remains unchanged and is interpreted.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1</name>
                                <description>MPU Region Number Register is overwritten by bits 3:0 (the REGION value).</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADDR</name>
                        <description>Region base address field. The position of the LSB depends on the region size, so that the base address is aligned according to an even multiple of size. The power of 2 size specified by the SZENABLE field of the MPU Region Attribute and Size Register defines how many bits of base address are used.</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1B</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
