cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P4011.svd
            <register>
                  <name>RSTCTL_PCMRESET_STAT</name>
                  <displayName>PCMRESET_STAT</displayName>
                  <description>PCM Reset Status Register</description>
                  <addressOffset>0x108</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>LPM35</name>
                        <description>Indicates if POR was caused by PCM due to an exit from LPM3.5</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>LPM45</name>
                        <description>Indicates if POR was caused by PCM due to an exit from LPM4.5</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>RSTCTL_PCMRESET_CLR</name>
                  <displayName>PCMRESET_CLR</displayName>
                  <description>PCM Reset Status Clear Register</description>
                  <addressOffset>0x10C</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>CLR</name>
                        <description>Write 1 clears all PCM Reset Flags in the RSTCTL_PCMRESET_STAT</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>RSTCTL_PINRESET_STAT</name>
                  <displayName>PINRESET_STAT</displayName>
                  <description>Pin Reset Status Register</description>
                  <addressOffset>0x110</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>RSTNMI</name>
                        <description>POR was caused by RSTn/NMI pin based reset event</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>RSTCTL_PINRESET_CLR</name>
                  <displayName>PINRESET_CLR</displayName>
                  <description>Pin Reset Status Clear Register</description>
                  <addressOffset>0x114</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>CLR</name>
                        <description>Write 1 clears the RSTn/NMI Pin Reset Flag in RSTCTL_PINRESET_STAT</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>RSTCTL_REBOOTRESET_STAT</name>
                  <displayName>REBOOTRESET_STAT</displayName>
                  <description>Reboot Reset Status Register</description>
                  <addressOffset>0x118</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>REBOOT</name>
                        <description>Indicates if Reboot reset was caused by the SYSCTL module.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>RSTCTL_REBOOTRESET_CLR</name>
                  <displayName>REBOOTRESET_CLR</displayName>
                  <description>Reboot Reset Status Clear Register</description>
                  <addressOffset>0x11C</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>CLR</name>
                        <description>Write 1 clears the Reboot Reset Flag in RSTCTL_REBOOTRESET_STAT</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>RSTCTL_CSRESET_STAT</name>
                  <displayName>CSRESET_STAT</displayName>
                  <description>CS Reset Status Register</description>
                  <addressOffset>0x120</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>DCOR_SHT</name>
                        <description>Indicates if POR was caused by DCO short circuit fault in the external resistor mode</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>RSTCTL_CSRESET_CLR</name>
                  <displayName>CSRESET_CLR</displayName>
                  <description>CS Reset Status Clear Register</description>
                  <addressOffset>0x124</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>CLR</name>
                        <description>Write 1 clears the DCOR_SHT Flag in RSTCTL_CSRESET_STAT as well as DCOR_SHTIFG flag in CSIFG register of clock system</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                  </fields>
            </register>
