cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P4011.svd
            <register>
                  <name>SYS_SECDATA_UNLOCK</name>
                  <displayName>SECDATA_UNLOCK</displayName>
                  <description>IP Protected Secure Zone Data Access Unlock Register</description>
                  <addressOffset>0x40</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>UNLKEY</name>
                        <description>Unlock key</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>SYS_SRAM_BANKEN_CTL0</name>
                  <displayName>SRAM_BANKEN_CTL0</displayName>
                  <description>SRAM Bank Enable Control Register 0</description>
                  <addressOffset>0x50</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0xffffffff</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>BNK0_EN</name>
                        <description>When 1, enables Bank0 of the SRAM</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>BNK1_EN</name>
                        <description>When 1, enables Bank1 of the SRAM</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK1_EN_0</name>
                                <description>Disables Bank1 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK1_EN_1</name>
                                <description>Enables Bank1 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK2_EN</name>
                        <description>When 1, enables Bank2 of the SRAM</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK2_EN_0</name>
                                <description>Disables Bank2 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK2_EN_1</name>
                                <description>Enables Bank2 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK3_EN</name>
                        <description>When 1, enables Bank3 of the SRAM</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK3_EN_0</name>
                                <description>Disables Bank3 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK3_EN_1</name>
                                <description>Enables Bank3 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK4_EN</name>
                        <description>When 1, enables Bank4 of the SRAM</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK4_EN_0</name>
                                <description>Disables Bank4 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK4_EN_1</name>
                                <description>Enables Bank4 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK5_EN</name>
                        <description>When 1, enables Bank5 of the SRAM</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK5_EN_0</name>
                                <description>Disables Bank5 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK5_EN_1</name>
                                <description>Enables Bank5 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK6_EN</name>
                        <description>When 1, enables Bank6 of the SRAM</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK6_EN_0</name>
                                <description>Disables Bank6 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK6_EN_1</name>
                                <description>Enables Bank6 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK7_EN</name>
                        <description>When 1, enables Bank7 of the SRAM</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK7_EN_0</name>
                                <description>Disables Bank7 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK7_EN_1</name>
                                <description>Enables Bank7 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK8_EN</name>
                        <description>When 1, enables Bank8 of the SRAM</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK8_EN_0</name>
                                <description>Disables Bank8 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK8_EN_1</name>
                                <description>Enables Bank8 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK9_EN</name>
                        <description>When 1, enables Bank9 of the SRAM</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK9_EN_0</name>
                                <description>Disables Bank9 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK9_EN_1</name>
                                <description>Enables Bank9 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK10_EN</name>
                        <description>When 1, enables Bank10 of the SRAM</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK10_EN_0</name>
                                <description>Disables Bank10 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK10_EN_1</name>
                                <description>Enables Bank10 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK11_EN</name>
                        <description>When 1, enables Bank11 of the SRAM</description>
                        <bitOffset>0xB</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK11_EN_0</name>
                                <description>Disables Bank11 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK11_EN_1</name>
                                <description>Enables Bank11 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK12_EN</name>
                        <description>When 1, enables Bank12 of the SRAM</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK12_EN_0</name>
                                <description>Disables Bank12 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK12_EN_1</name>
                                <description>Enables Bank12 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK13_EN</name>
                        <description>When 1, enables Bank13 of the SRAM</description>
                        <bitOffset>0xD</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK13_EN_0</name>
                                <description>Disables Bank13 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK13_EN_1</name>
                                <description>Enables Bank13 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK14_EN</name>
                        <description>When 1, enables Bank14 of the SRAM</description>
                        <bitOffset>0xE</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK14_EN_0</name>
                                <description>Disables Bank14 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK14_EN_1</name>
                                <description>Enables Bank14 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK15_EN</name>
                        <description>When 1, enables Bank15 of the SRAM</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK15_EN_0</name>
                                <description>Disables Bank15 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK15_EN_1</name>
                                <description>Enables Bank15 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK16_EN</name>
                        <description>When 1, enables Bank16 of the SRAM</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK16_EN_0</name>
                                <description>Disables Bank16 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK16_EN_1</name>
                                <description>Enables Bank16 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK17_EN</name>
                        <description>When 1, enables Bank17 of the SRAM</description>
                        <bitOffset>0x11</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK17_EN_0</name>
                                <description>Disables Bank17 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK17_EN_1</name>
                                <description>Enables Bank17 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK18_EN</name>
                        <description>When 1, enables Bank18 of the SRAM</description>
                        <bitOffset>0x12</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK18_EN_0</name>
                                <description>Disables Bank18 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK18_EN_1</name>
                                <description>Enables Bank18 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK19_EN</name>
                        <description>When 1, enables Bank19 of the SRAM</description>
                        <bitOffset>0x13</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK19_EN_0</name>
                                <description>Disables Bank19 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK19_EN_1</name>
                                <description>Enables Bank19 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK20_EN</name>
                        <description>When 1, enables Bank20 of the SRAM</description>
                        <bitOffset>0x14</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK20_EN_0</name>
                                <description>Disables Bank20 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK20_EN_1</name>
                                <description>Enables Bank20 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK21_EN</name>
                        <description>When 1, enables Bank21 of the SRAM</description>
                        <bitOffset>0x15</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK21_EN_0</name>
                                <description>Disables Bank21 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK21_EN_1</name>
                                <description>Enables Bank21 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK22_EN</name>
                        <description>When 1, enables Bank22 of the SRAM</description>
                        <bitOffset>0x16</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK22_EN_0</name>
                                <description>Disables Bank22 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK22_EN_1</name>
                                <description>Enables Bank22 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
