cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P4011.svd
            <register>
                  <name>SYS_SRAM_BLKRET_CTL0</name>
                  <displayName>SRAM_BLKRET_CTL0</displayName>
                  <description>SRAM Block Retention Control Register 0</description>
                  <addressOffset>0x70</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0xffffffff</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>BLK0_EN</name>
                        <description>Block0 is always retained in LPM3, LPM4 and LPM3.5 modes of operation</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>BLK1_EN</name>
                        <description>When 1, Block1 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK1_EN_0</name>
                                <description>Block1 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK1_EN_1</name>
                                <description>Block1 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK2_EN</name>
                        <description>When 1, Block2 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK2_EN_0</name>
                                <description>Block2 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK2_EN_1</name>
                                <description>Block2 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK3_EN</name>
                        <description>When 1, Block3 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK3_EN_0</name>
                                <description>Block3 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK3_EN_1</name>
                                <description>Block3 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK4_EN</name>
                        <description>When 1, Block4 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK4_EN_0</name>
                                <description>Block4 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK4_EN_1</name>
                                <description>Block4 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK5_EN</name>
                        <description>When 1, Block5 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK5_EN_0</name>
                                <description>Block5 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK5_EN_1</name>
                                <description>Block5 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK6_EN</name>
                        <description>When 1, Block6 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK6_EN_0</name>
                                <description>Block6 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK6_EN_1</name>
                                <description>Block6 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK7_EN</name>
                        <description>When 1, Block7 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK7_EN_0</name>
                                <description>Block7 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK7_EN_1</name>
                                <description>Block7 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK8_EN</name>
                        <description>When 1, Block8 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK8_EN_0</name>
                                <description>Block8 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK8_EN_1</name>
                                <description>Block8 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK9_EN</name>
                        <description>When 1, Block9 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK9_EN_0</name>
                                <description>Block9 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK9_EN_1</name>
                                <description>Block9 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK10_EN</name>
                        <description>When 1, Block10 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK10_EN_0</name>
                                <description>Block10 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK10_EN_1</name>
                                <description>Block10 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK11_EN</name>
                        <description>When 1, Block11 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0xB</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK11_EN_0</name>
                                <description>Block11 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK11_EN_1</name>
                                <description>Block11 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK12_EN</name>
                        <description>When 1, Block12 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK12_EN_0</name>
                                <description>Block12 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK12_EN_1</name>
                                <description>Block12 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK13_EN</name>
                        <description>When 1, Block13 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0xD</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK13_EN_0</name>
                                <description>Block13 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK13_EN_1</name>
                                <description>Block13 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK14_EN</name>
                        <description>When 1, Block14 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0xE</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK14_EN_0</name>
                                <description>Block14 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK14_EN_1</name>
                                <description>Block14 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK15_EN</name>
                        <description>When 1, Block15 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK15_EN_0</name>
                                <description>Block15 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK15_EN_1</name>
                                <description>Block15 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK16_EN</name>
                        <description>When 1, Block16 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK16_EN_0</name>
                                <description>Block16 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK16_EN_1</name>
                                <description>Block16 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK17_EN</name>
                        <description>When 1, Block17 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x11</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK17_EN_0</name>
                                <description>Block17 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK17_EN_1</name>
                                <description>Block17 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK18_EN</name>
                        <description>When 1, Block18 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x12</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK18_EN_0</name>
                                <description>Block18 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK18_EN_1</name>
                                <description>Block18 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK19_EN</name>
                        <description>When 1, Block19 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x13</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK19_EN_0</name>
                                <description>Block19 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK19_EN_1</name>
                                <description>Block19 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK20_EN</name>
                        <description>When 1, Block20 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x14</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK20_EN_0</name>
                                <description>Block20 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK20_EN_1</name>
                                <description>Block20 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK21_EN</name>
                        <description>When 1, Block21 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x15</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK21_EN_0</name>
                                <description>Block21 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK21_EN_1</name>
                                <description>Block21 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK22_EN</name>
                        <description>When 1, Block22 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x16</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
